{
  "displayName": "Prevent External Access",
  "state": "enabledForReportingButNotEnforced",
  "conditions": {
    "applications": {
      "includeUserActions": [],
      "includeAuthenticationContextClassReferences": [],
      "excludeApplications": [],
      "includeApplications": [
        "All"
      ]
    },
    "clientAppTypes": [
      "exchangeActiveSync",
      "browser",
      "mobileAppsAndDesktopClients",
      "other"
    ],
    "locations": {
      "excludeLocations": [
        "00000000-0000-0000-0000-000000000000"
      ],
      "includeLocations": [
        "All"
      ]
    },
    "users": {
      "includeUsers": [
        "All"
      ],
      "includeGroups": [],
      "excludeUsers": [],
      "includeRoles": [],
      "excludeGuestsOrExternalUsers": {
        "guestOrExternalUserTypes": "b2bCollaborationGuest,serviceProvider",
        "externalTenants": "@{@odata.type=#microsoft.graph.conditionalAccessAllExternalTenants; membershipKind=all}"
      },
      "excludeGroups": [],
      "excludeRoles": [],
      "includeGuestsOrExternalUsers": null
    },
    "platforms": {
      "excludePlatforms": [],
      "includePlatforms": [
        "all"
      ]
    },
    "grantControls": {
      "builtInControls": [
        "block"
      ],
      "operator": "OR"
    }
  }
}