{
  "state": "enabledForReportingButNotEnforced",
  "grantControls": {
    "builtInControls": ["block"],
    "operator": "OR",
    "termsOfUse": [],
    "customAuthenticationFactors": []
  },
  "displayName": "Block legacy authentication",
  "conditions": {
    "deviceStates": null,
    "clientAppTypes": ["exchangeActiveSync", "other"],
    "signInRiskLevels": [],
    "userRiskLevels": [],
    "applications": {
      "excludeApplications": [],
      "includeAuthenticationContextClassReferences": [],
      "includeUserActions": [],
      "includeApplications": ["All"]
    },
    "times": null,
    "devices": null,
    "clientApplications": null,
    "users": {
      "includeUsers": ["All"],
      "includeGroups": [],
      "excludeUsers": [],
      "includeGuestsOrExternalUsers": null,
      "includeRoles": [],
      "excludeGroups": [],
      "excludeGuestsOrExternalUsers": null,
      "excludeRoles": []
    },
    "locations": null,
    "platforms": null,
    "servicePrincipalRiskLevels": []
  }
}
